--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
 opened on:  29 Jun 2020, 15:43:58

. traj, var(WBC_*) indep(T_*) model(cnorm) min(0) max(40) order(0 2 2 3) risk(RACE_White)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         6.68941      0.11574          57.796       0.0000
 
 2       Intercept         8.53989      0.22249          38.384       0.0000
         Linear            0.23618      0.07219           3.271       0.0011
         Quadratic        -0.01632      0.00503          -3.244       0.0012
 
 3       Intercept        12.69374      0.63339          20.041       0.0000
         Linear           -0.32264      0.20204          -1.597       0.1103
         Quadratic         0.02683      0.01354           1.981       0.0476
 
 4       Intercept         5.99492      0.73108           8.200       0.0000
         Linear            3.77094      0.45433           8.300       0.0000
         Quadratic        -0.37061      0.07299          -5.077       0.0000
         Cubic             0.00949      0.00331           2.864       0.0042
 
         Sigma             3.48710      0.02697         129.309       0.0000
 
  Group membership
 
 1       Baseline         (0.00000)           .               .            . 
 
 2       Constant         -0.50437      0.21788          -2.315       0.0206
         RACE_White        0.95964      0.20467           4.689       0.0000
 
 3       Constant         -2.30662      0.34941          -6.601       0.0000
         RACE_White        1.39167      0.34693           4.011       0.0001
 
 4       Constant         -2.33654      0.27139          -8.610       0.0000
         RACE_White        0.99554      0.30343           3.281       0.0010
 
 BIC=-26694.98 (N=9651)  BIC=-26678.03 (N=1468)  AIC=-26630.41  ll= -26612.41

. log off
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
 paused on:  29 Jun 2020, 15:44:12
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
resumed on:  29 Jun 2020, 16:14:25

. traj, var(WBC_*) indep(T_*) model(cnorm) min(0) max(40) order(0 2 2 3) risk(RACE_White) refgroup(4)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         6.68941      0.11574          57.795       0.0000
 
 2       Intercept         8.53988      0.22248          38.384       0.0000
         Linear            0.23618      0.07219           3.272       0.0011
         Quadratic        -0.01632      0.00503          -3.244       0.0012
 
 3       Intercept        12.69376      0.63327          20.045       0.0000
         Linear           -0.32265      0.20199          -1.597       0.1102
         Quadratic         0.02683      0.01354           1.982       0.0476
 
 4       Intercept         5.99494      0.73017           8.210       0.0000
         Linear            3.77093      0.45312           8.322       0.0000
         Quadratic        -0.37061      0.07282          -5.090       0.0000
         Cubic             0.00949      0.00331           2.869       0.0041
 
         Sigma             3.48710      0.02697         129.278       0.0000
 
  Group membership
 
 1       Constant          2.33652      0.27137           8.610       0.0000
         RACE_White       -0.99553      0.30343          -3.281       0.0010
 
 2       Constant          1.83216      0.29371           6.238       0.0000
         RACE_White       -0.03590      0.31511          -0.114       0.9093
 
 3       Constant          0.02989      0.44069           0.068       0.9459
         RACE_White        0.39616      0.46579           0.851       0.3951
 
 4       Baseline         (0.00000)           .               .            . 
 
 BIC=-26694.98 (N=9651)  BIC=-26678.03 (N=1468)  AIC=-26630.41  ll= -26612.41

. traj, var(WBC_*) indep(T_*) model(cnorm) min(0) max(40) order(0 2 2 3) risk(RACE_White) refgroup(3)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         6.68942      0.11574          57.796       0.0000
 
 2       Intercept         8.53985      0.22248          38.384       0.0000
         Linear            0.23620      0.07219           3.272       0.0011
         Quadratic        -0.01632      0.00503          -3.245       0.0012
 
 3       Intercept        12.69378      0.63327          20.045       0.0000
         Linear           -0.32264      0.20199          -1.597       0.1102
         Quadratic         0.02683      0.01354           1.981       0.0476
 
 4       Intercept         5.99497      0.73016           8.210       0.0000
         Linear            3.77089      0.45312           8.322       0.0000
         Quadratic        -0.37060      0.07282          -5.090       0.0000
         Cubic             0.00949      0.00331           2.869       0.0041
 
         Sigma             3.48710      0.02697         129.278       0.0000
 
  Group membership
 
 1       Constant          2.30663      0.34940           6.602       0.0000
         RACE_White       -1.39163      0.34693          -4.011       0.0001
 
 2       Constant          1.80226      0.37200           4.845       0.0000
         RACE_White       -0.43200      0.39198          -1.102       0.2704
 
 3       Baseline         (0.00000)           .               .            . 
 
 4       Constant         -0.02988      0.44069          -0.068       0.9459
         RACE_White       -0.39609      0.46579          -0.850       0.3951
 
 BIC=-26694.98 (N=9651)  BIC=-26678.03 (N=1468)  AIC=-26630.41  ll= -26612.41

. trajplot, xtitle(Time) ytitle(WBC)

. log off
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
 paused on:  29 Jun 2020, 16:15:07
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
resumed on:  29 Jun 2020, 17:00:10

. traj, var(WBC_*) indep(T_*) model(cnorm) min(0) max(40) order(0 2 2 3) risk(FEMALE) refgroup(4)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         6.72411      0.11399          58.986       0.0000
 
 2       Intercept         8.64296      0.22553          38.323       0.0000
         Linear            0.22165      0.07409           2.992       0.0028
         Quadratic        -0.01581      0.00514          -3.074       0.0021
 
 3       Intercept        12.52720      0.66916          18.721       0.0000
         Linear           -0.25457      0.21520          -1.183       0.2369
         Quadratic         0.02267      0.01438           1.577       0.1149
 
 4       Intercept         5.94873      0.74863           7.946       0.0000
         Linear            3.83165      0.46482           8.243       0.0000
         Quadratic        -0.37996      0.07464          -5.091       0.0000
         Cubic             0.00987      0.00339           2.908       0.0036
 
         Sigma             3.48731      0.02698         129.241       0.0000
 
  Group membership
 
 1       Constant          2.02271      0.21747           9.301       0.0000
         FEMALE           -0.73806      0.26529          -2.782       0.0054
 
 2       Constant          2.06479      0.21965           9.400       0.0000
         FEMALE           -0.60506      0.26460          -2.287       0.0222
 
 3       Constant          0.74483      0.30776           2.420       0.0155
         FEMALE           -0.85236      0.38568          -2.210       0.0271
 
 4       Baseline         (0.00000)           .               .            . 
 
 BIC=-26712.95 (N=9651)  BIC=-26696.00 (N=1468)  AIC=-26648.38  ll= -26630.38

. traj, var(WBC_*) indep(T_*) model(cnorm) min(0) max(40) order(0 2 2 3) risk(FEMALE) refgroup(3)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         6.72406      0.11400          58.985       0.0000
 
 2       Intercept         8.64296      0.22552          38.324       0.0000
         Linear            0.22164      0.07408           2.992       0.0028
         Quadratic        -0.01581      0.00514          -3.074       0.0021
 
 3       Intercept        12.52762      0.66915          18.722       0.0000
         Linear           -0.25466      0.21519          -1.183       0.2367
         Quadratic         0.02267      0.01438           1.577       0.1148
 
 4       Intercept         5.94884      0.74860           7.947       0.0000
         Linear            3.83152      0.46480           8.243       0.0000
         Quadratic        -0.37994      0.07464          -5.091       0.0000
         Cubic             0.00987      0.00339           2.908       0.0036
 
         Sigma             3.48731      0.02698         129.243       0.0000
 
  Group membership
 
 1       Constant          1.27795      0.24616           5.191       0.0000
         FEMALE            0.11428      0.27341           0.418       0.6760
 
 2       Constant          1.32008      0.23994           5.502       0.0000
         FEMALE            0.24723      0.31690           0.780       0.4353
 
 3       Baseline         (0.00000)           .               .            . 
 
 4       Constant         -0.74467      0.30776          -2.420       0.0156
         FEMALE            0.85221      0.38567           2.210       0.0272
 
 BIC=-26712.95 (N=9651)  BIC=-26696.00 (N=1468)  AIC=-26648.38  ll= -26630.38

. trajplot, xtitle(Time) ytitle(WBC)

. log off
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
 paused on:  29 Jun 2020, 17:06:28
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
resumed on:  29 Jun 2020, 17:07:56

. traj, var(WBC_*) indep(T_*) model(cnorm) min(0) max(40) order(0 2 2 3) risk(COPD_HST) refgroup(4)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         6.74972      0.11313          59.664       0.0000
 
 2       Intercept         8.64900      0.23225          37.240       0.0000
         Linear            0.24036      0.07427           3.236       0.0012
         Quadratic        -0.01712      0.00516          -3.321       0.0009
 
 3       Intercept        12.97166      0.60742          21.355       0.0000
         Linear           -0.38557      0.20552          -1.876       0.0607
         Quadratic         0.03035      0.01402           2.165       0.0304
 
 4       Intercept         5.91816      0.74495           7.944       0.0000
         Linear            3.76547      0.45771           8.227       0.0000
         Quadratic        -0.36599      0.07324          -4.997       0.0000
         Cubic             0.00922      0.00333           2.770       0.0056
 
         Sigma             3.48678      0.02696         129.328       0.0000
 
  Group membership
 
 1       Constant          1.71305      0.16594          10.323       0.0000
         COPD_HST         -0.11425      0.33112          -0.345       0.7301
 
 2       Constant          1.73072      0.16492          10.494       0.0000
         COPD_HST          0.09342      0.33761           0.277       0.7820
 
 3       Constant         -0.04171      0.27785          -0.150       0.8807
         COPD_HST          1.08058      0.42260           2.557       0.0106
 
 4       Baseline         (0.00000)           .               .            . 
 
 BIC=-26707.94 (N=9651)  BIC=-26690.99 (N=1468)  AIC=-26643.37  ll= -26625.37

. traj, var(WBC_*) indep(T_*) model(cnorm) min(0) max(40) order(0 2 2 3) risk(COPD_HST) refgroup(3)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         6.74970      0.11313          59.662       0.0000
 
 2       Intercept         8.64900      0.23224          37.242       0.0000
         Linear            0.24036      0.07427           3.236       0.0012
         Quadratic        -0.01712      0.00516          -3.321       0.0009
 
 3       Intercept        12.97171      0.60754          21.351       0.0000
         Linear           -0.38558      0.20549          -1.876       0.0606
         Quadratic         0.03035      0.01401           2.166       0.0303
 
 4       Intercept         5.91828      0.74556           7.938       0.0000
         Linear            3.76538      0.45919           8.200       0.0000
         Quadratic        -0.36597      0.07349          -4.980       0.0000
         Cubic             0.00922      0.00334           2.762       0.0057
 
         Sigma             3.48678      0.02697         129.304       0.0000
 
  Group membership
 
 1       Constant          1.75479      0.26513           6.619       0.0000
         COPD_HST         -1.19484      0.27753          -4.305       0.0000
 
 2       Constant          1.77248      0.23926           7.408       0.0000
         COPD_HST         -0.98719      0.31371          -3.147       0.0017
 
 3       Baseline         (0.00000)           .               .            . 
 
 4       Constant          0.04177      0.27790           0.150       0.8805
         COPD_HST         -1.08056      0.42256          -2.557       0.0106
 
 BIC=-26707.94 (N=9651)  BIC=-26690.99 (N=1468)  AIC=-26643.37  ll= -26625.37

. log off
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
 paused on:  29 Jun 2020, 17:17:11
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
resumed on:  29 Jun 2020, 17:21:55

. traj, var(WBC_*) indep(T_*) model(cnorm) min(0) max(40) order(0 2 2 3) risk(CKD_HST) refgroup(4)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         6.72147      0.11503          58.432       0.0000
 
 2       Intercept         8.61452      0.22555          38.194       0.0000
         Linear            0.22992      0.07336           3.134       0.0017
         Quadratic        -0.01618      0.00512          -3.160       0.0016
 
 3       Intercept        12.76868      0.63745          20.031       0.0000
         Linear           -0.33400      0.20529          -1.627       0.1038
         Quadratic         0.02754      0.01380           1.996       0.0460
 
 4       Intercept         5.94250      0.73821           8.050       0.0000
         Linear            3.79110      0.45607           8.313       0.0000
         Quadratic        -0.37293      0.07301          -5.108       0.0000
         Cubic             0.00957      0.00331           2.891       0.0038
 
         Sigma             3.48610      0.02696         129.315       0.0000
 
  Group membership
 
 1       Constant          1.55608      0.16485           9.439       0.0000
         CKD_HST           0.91431      0.43935           2.081       0.0375
 
 2       Constant          1.72253      0.15835          10.878       0.0000
         CKD_HST           0.47697      0.44767           1.065       0.2867
 
 3       Constant          0.29196      0.24090           1.212       0.2256
         CKD_HST           0.34604      0.60057           0.576       0.5645
 
 4       Baseline         (0.00000)           .               .            . 
 
 BIC=-26712.79 (N=9651)  BIC=-26695.84 (N=1468)  AIC=-26648.22  ll= -26630.22

. log off
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
 paused on:  29 Jun 2020, 17:24:41
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
resumed on:  30 Jun 2020, 22:34:46

. traj, var(HGB_*) indep(T_*) model(cnorm) min(2) max(25) order(3 3 3 2 1) risk(FEMALE) refgroup(1)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept        10.13540      0.19935          50.843       0.0000
         Linear           -0.51396      0.10467          -4.910       0.0000
         Quadratic         0.06608      0.01615           4.091       0.0000
         Cubic            -0.00244      0.00071          -3.421       0.0006
 
 2       Intercept        11.05021      0.22470          49.177       0.0000
         Linear           -0.29676      0.12349          -2.403       0.0163
         Quadratic         0.04346      0.01877           2.315       0.0206
         Cubic            -0.00168      0.00083          -2.024       0.0430
 
 3       Intercept        12.73351      0.26919          47.303       0.0000
         Linear           -0.17161      0.14331          -1.197       0.2311
         Quadratic        -0.05227      0.02253          -2.320       0.0204
         Cubic             0.00333      0.00100           3.339       0.0008
 
 4       Intercept        12.64820      0.16867          74.988       0.0000
         Linear            0.00870      0.04582           0.190       0.8493
         Quadratic        -0.00976      0.00296          -3.299       0.0010
 
 5       Intercept        14.53918      0.09775         148.736       0.0000
         Linear           -0.11137      0.01328          -8.386       0.0000
 
         Sigma             1.44843      0.01114         130.053       0.0000
 
  Group membership
 
 1       Baseline         (0.00000)           .               .            . 
 
 2       Constant          0.30298      0.23311           1.300       0.1937
         FEMALE            0.04526      0.22667           0.200       0.8417
 
 3       Constant          0.14026      0.20470           0.685       0.4932
         FEMALE           -0.32771      0.24222          -1.353       0.1761
 
 4       Constant          0.46497      0.18109           2.568       0.0103
         FEMALE           -0.74938      0.22445          -3.339       0.0008
 
 5       Constant          0.22107      0.18921           1.168       0.2427
         FEMALE           -1.73772      0.27924          -6.223       0.0000
 
 BIC=-18953.67 (N=9709)  BIC=-18929.11 (N=1468)  AIC=-18860.32  ll= -18834.32

. log off
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
 paused on:  30 Jun 2020, 22:35:00
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
resumed on:  30 Jun 2020, 22:38:43

. traj, var(HGB_*) indep(T_*) model(cnorm) min(2) max(25) order(3 3 3 2 1) risk(INSUR_Commercial) refgroup(1)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept        10.10376      0.20177          50.074       0.0000
         Linear           -0.51096      0.10649          -4.798       0.0000
         Quadratic         0.06602      0.01644           4.016       0.0001
         Cubic            -0.00245      0.00073          -3.372       0.0007
 
 2       Intercept        11.02746      0.22979          47.989       0.0000
         Linear           -0.30418      0.12314          -2.470       0.0135
         Quadratic         0.04510      0.01871           2.411       0.0159
         Cubic            -0.00175      0.00082          -2.126       0.0335
 
 3       Intercept        12.70482      0.26072          48.730       0.0000
         Linear           -0.17910      0.13958          -1.283       0.1995
         Quadratic        -0.05044      0.02210          -2.282       0.0225
         Cubic             0.00325      0.00098           3.311       0.0009
 
 4       Intercept        12.63793      0.16774          75.341       0.0000
         Linear            0.00937      0.04576           0.205       0.8377
         Quadratic        -0.00972      0.00297          -3.269       0.0011
 
 5       Intercept        14.53600      0.10192         142.623       0.0000
         Linear           -0.11028      0.01346          -8.195       0.0000
 
         Sigma             1.44874      0.01114         130.081       0.0000
 
  Group membership
 
 1       Baseline         (0.00000)           .               .            . 
 
 2       Constant          0.33253      0.20615           1.613       0.1068
         INSUR_Commer      0.08498      0.36868           0.231       0.8177
 
 3       Constant         -0.09792      0.21086          -0.464       0.6424
         INSUR_Commer      0.80945      0.29872           2.710       0.0067
 
 4       Constant          0.07947      0.18559           0.428       0.6685
         INSUR_Commer      0.79394      0.27817           2.854       0.0043
 
 5       Constant         -0.47341      0.19597          -2.416       0.0157
         INSUR_Commer      1.09639      0.28326           3.871       0.0001
 
 BIC=-18978.03 (N=9709)  BIC=-18953.47 (N=1468)  AIC=-18884.68  ll= -18858.68

. traj, var(HGB_*) indep(T_*) model(cnorm) min(2) max(25) order(3 3 3 2 1) risk(INSUR_Medicare) refgroup(1)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept        10.10612      0.20705          48.810       0.0000
         Linear           -0.52355      0.11024          -4.749       0.0000
         Quadratic         0.06804      0.01694           4.016       0.0001
         Cubic            -0.00254      0.00074          -3.410       0.0007
 
 2       Intercept        10.93713      0.23695          46.158       0.0000
         Linear           -0.28488      0.12417          -2.294       0.0218
         Quadratic         0.04322      0.01897           2.278       0.0227
         Cubic            -0.00168      0.00084          -2.015       0.0439
 
 3       Intercept        12.68268      0.25835          49.091       0.0000
         Linear           -0.19735      0.13504          -1.461       0.1439
         Quadratic        -0.04633      0.02123          -2.182       0.0291
         Cubic             0.00307      0.00094           3.255       0.0011
 
 4       Intercept        12.63468      0.16617          76.036       0.0000
         Linear            0.00403      0.04525           0.089       0.9290
         Quadratic        -0.00936      0.00293          -3.190       0.0014
 
 5       Intercept        14.52825      0.10142         143.243       0.0000
         Linear           -0.10994      0.01333          -8.247       0.0000
 
         Sigma             1.44893      0.01116         129.839       0.0000
 
  Group membership
 
 1       Baseline         (0.00000)           .               .            . 
 
 2       Constant          0.24738      0.28337           0.873       0.3827
         INSUR_Medica      0.15309      0.28309           0.541       0.5887
 
 3       Constant          0.46605      0.24482           1.904       0.0570
         INSUR_Medica     -0.53233      0.23999          -2.218       0.0266
 
 4       Constant          0.73764      0.21412           3.445       0.0006
         INSUR_Medica     -0.75966      0.22157          -3.429       0.0006
 
 5       Constant          0.27702      0.22916           1.209       0.2267
         INSUR_Medica     -0.77834      0.22828          -3.410       0.0007
 
 BIC=-18974.66 (N=9709)  BIC=-18950.10 (N=1468)  AIC=-18881.31  ll= -18855.31

. log off
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
 paused on:  30 Jun 2020, 22:38:54
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
resumed on:  30 Jun 2020, 22:57:18

. traj, var(HGB_*) indep(T_*) model(cnorm) min(2) max(25) order(3 3 3 2 1) risk(HTN_HST) refgroup(1)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept        10.10473      0.20261          49.874       0.0000
         Linear           -0.50718      0.10619          -4.776       0.0000
         Quadratic         0.06536      0.01638           3.990       0.0001
         Cubic            -0.00242      0.00072          -3.340       0.0008
 
 2       Intercept        11.06495      0.23113          47.874       0.0000
         Linear           -0.31294      0.12232          -2.558       0.0105
         Quadratic         0.04541      0.01847           2.459       0.0140
         Cubic            -0.00175      0.00082          -2.148       0.0318
 
 3       Intercept        12.74147      0.26564          47.964       0.0000
         Linear           -0.17049      0.14514          -1.175       0.2401
         Quadratic        -0.05259      0.02290          -2.296       0.0217
         Cubic             0.00334      0.00101           3.308       0.0009
 
 4       Intercept        12.63012      0.16782          75.260       0.0000
         Linear            0.01047      0.04599           0.228       0.8200
         Quadratic        -0.00965      0.00298          -3.237       0.0012
 
 5       Intercept        14.54042      0.10287         141.345       0.0000
         Linear           -0.11094      0.01352          -8.206       0.0000
 
         Sigma             1.44871      0.01115         129.943       0.0000
 
  Group membership
 
 1       Baseline         (0.00000)           .               .            . 
 
 2       Constant          0.53276      0.26557           2.006       0.0449
         HTN_HST          -0.25451      0.24502          -1.039       0.2990
 
 3       Constant          0.20637      0.27088           0.762       0.4462
         HTN_HST          -0.29040      0.25641          -1.133       0.2574
 
 4       Constant          0.66425      0.22128           3.002       0.0027
         HTN_HST          -0.71745      0.21683          -3.309       0.0009
 
 5       Constant          0.10447      0.23862           0.438       0.6615
         HTN_HST          -0.54889      0.22680          -2.420       0.0155
 
 BIC=-18986.45 (N=9709)  BIC=-18961.89 (N=1468)  AIC=-18893.09  ll= -18867.09

. traj, var(HGB_*) indep(T_*) model(cnorm) min(2) max(25) order(3 3 3 2 1) risk(HYPERLIPIDEMIA_HST) refgroup(1)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept        10.09166      0.19725          51.161       0.0000
         Linear           -0.49195      0.10411          -4.725       0.0000
         Quadratic         0.06302      0.01609           3.916       0.0001
         Cubic            -0.00231      0.00071          -3.251       0.0012
 
 2       Intercept        11.17775      0.21639          51.655       0.0000
         Linear           -0.34653      0.11470          -3.021       0.0025
         Quadratic         0.04867      0.01765           2.757       0.0058
         Cubic            -0.00187      0.00079          -2.374       0.0176
 
 3       Intercept        12.75571      0.27120          47.034       0.0000
         Linear           -0.13363      0.14640          -0.913       0.3614
         Quadratic        -0.05966      0.02309          -2.584       0.0098
         Cubic             0.00363      0.00102           3.552       0.0004
 
 4       Intercept        12.63070      0.17056          74.054       0.0000
         Linear            0.01487      0.04579           0.325       0.7453
         Quadratic        -0.00984      0.00298          -3.304       0.0010
 
 5       Intercept        14.55363      0.10618         137.067       0.0000
         Linear           -0.11078      0.01376          -8.050       0.0000
 
         Sigma             1.44881      0.01114         130.097       0.0000
 
  Group membership
 
 1       Baseline         (0.00000)           .               .            . 
 
 2       Constant          0.60065      0.22540           2.665       0.0077
         HYPERLIPIDEM     -0.46900      0.22373          -2.096       0.0361
 
 3       Constant         -0.06962      0.26420          -0.264       0.7922
         HYPERLIPIDEM      0.01401      0.25057           0.056       0.9554
 
 4       Constant          0.42804      0.20004           2.140       0.0324
         HYPERLIPIDEM     -0.47791      0.20764          -2.302       0.0214
 
 5       Constant          0.09180      0.20745           0.442       0.6581
         HYPERLIPIDEM     -0.84794      0.22532          -3.763       0.0002
 
 BIC=-18984.84 (N=9709)  BIC=-18960.28 (N=1468)  AIC=-18891.49  ll= -18865.49

. traj, var(HGB_*) indep(T_*) model(cnorm) min(2) max(25) order(3 3 3 2 1) risk(DIAB_HST) refgroup(1)
 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May 12 2020
 
1468 observations read.
1468 observations used in the trajectory model.
 
                        Maximum Likelihood Estimates
                        Model: Censored Normal (cnorm)

                                       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept        10.10850      0.18895          53.497       0.0000
         Linear           -0.49484      0.10204          -4.849       0.0000
         Quadratic         0.06359      0.01579           4.027       0.0001
         Cubic            -0.00234      0.00070          -3.345       0.0008
 
 2       Intercept        11.07282      0.23804          46.517       0.0000
         Linear           -0.30132      0.12279          -2.454       0.0141
         Quadratic         0.04467      0.01862           2.399       0.0165
         Cubic            -0.00174      0.00083          -2.110       0.0349
 
 3       Intercept        12.72994      0.26435          48.156       0.0000
         Linear           -0.17985      0.14469          -1.243       0.2139
         Quadratic        -0.05040      0.02300          -2.191       0.0285
         Cubic             0.00323      0.00102           3.183       0.0015
 
 4       Intercept        12.66615      0.15953          79.395       0.0000
         Linear            0.00292      0.04491           0.065       0.9482
         Quadratic        -0.00924      0.00295          -3.136       0.0017
 
 5       Intercept        14.54705      0.10226         142.252       0.0000
         Linear           -0.11109      0.01355          -8.197       0.0000
 
         Sigma             1.44845      0.01114         130.078       0.0000
 
  Group membership
 
 1       Baseline         (0.00000)           .               .            . 
 
 2       Constant          0.54045      0.21484           2.516       0.0119
         DIAB_HST         -0.46154      0.23894          -1.932       0.0534
 
 3       Constant          0.26278      0.24605           1.068       0.2856
         DIAB_HST         -0.53742      0.23845          -2.254       0.0242
 
 4       Constant          0.74719      0.18113           4.125       0.0000
         DIAB_HST         -1.22567      0.21541          -5.690       0.0000
 
 5       Constant          0.20765      0.19592           1.060       0.2892
         DIAB_HST         -1.04618      0.22151          -4.723       0.0000
 
 BIC=-18968.52 (N=9709)  BIC=-18943.97 (N=1468)  AIC=-18875.17  ll= -18849.17

. log off
      name:  <unnamed>
       log:  /Users/jinchenxie/Documents/GitHub/HF_project_code/GBTM/covariates significance test.log
  log type:  text
 paused on:  30 Jun 2020, 22:57:38
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
